app/Controllers/Auth.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Wishmi', 'wishmi123@gmail.com', '6a9edcb7b63821802aa44d35d531c9fc')
SELECT *
FROM `users`
WHERE `email` = 'wishmi123@gmail.com'
 LIMIT 1
---
    public function save()
    {

      $validation =  \Config\Services::validation();
      $rules=[
        'name'=>'required',
        'email'=>'required|valid_email|is_unique[users.email]',
        'mobile'=>'required|min_length[10]',
        'password'=>'required|min_length[5]',
        'confirm_password'=>'required|min_length[5]|matches[password]'
      ];

      helper(['form']);

      if($this->validate($rules)){
        $model = new UserModel();
            $newUser = [
                'name' => $this->request->getVar('name'),
                'email' => $this->request->getVar('email'),
                'mobile' => $this->request->getVar('mobile'),
                'password' => md5($this->request->getVar('password'))
            ];
            $model->save( $newUser );
            $user = $model->where('email', $newUser['email'])->first();

SELECT *
FROM `users`
WHERE `email` = 'lumini0804@gmail.com'
 LIMIT 1
---
    public function auth()
    {
      $validation =  \Config\Services::validation();
      $rules=[
        'email'=>'required|valid_email',
        'password'=>'required|min_length[5]',

      ];

      if($this->validate($rules)){
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $user = $model->where('email', $email)->first();